## Terraform Plan — `prod`

<details><summary>Show Plan</summary>

```hcl
module.networking.data.aws_availability_zones.available: Reading...
module.networking.aws_vpc.main: Refreshing state... [id=vpc-0c305d02bb6b97041]
module.glue.aws_iam_role.glue: Refreshing state... [id=de1-prod-glue-role]
module.lambda.aws_iam_role.lambda: Refreshing state... [id=de1-prod-lambda-role]
module.s3.aws_s3_bucket.lambda_packages: Refreshing state... [id=de1-prod-lambda-packages]
module.s3.aws_s3_bucket.data_lake: Refreshing state... [id=de1-prod-data-lake]
module.s3.aws_s3_bucket.glue_scripts: Refreshing state... [id=de1-prod-glue-scripts]
module.networking.data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.glue.aws_iam_role_policy_attachment.glue_service: Refreshing state... [id=de1-prod-glue-role-20260226002224087100000001]
module.lambda.aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=de1-prod-lambda-role-20260226002224134600000002]
module.s3.aws_s3_bucket_public_access_block.data_lake: Refreshing state... [id=de1-prod-data-lake]
module.s3.aws_s3_bucket_server_side_encryption_configuration.data_lake: Refreshing state... [id=de1-prod-data-lake]
module.s3.aws_s3_bucket_versioning.data_lake: Refreshing state... [id=de1-prod-data-lake]
module.s3.aws_s3_object.data_lake_zones["raw/"]: Refreshing state... [id=raw/]
module.s3.aws_s3_object.data_lake_zones["curated/"]: Refreshing state... [id=curated/]
module.s3.aws_s3_object.data_lake_zones["processed/"]: Refreshing state... [id=processed/]
module.s3.aws_s3_bucket_public_access_block.glue_scripts: Refreshing state... [id=de1-prod-glue-scripts]
module.s3.aws_s3_bucket_server_side_encryption_configuration.glue_scripts: Refreshing state... [id=de1-prod-glue-scripts]
module.s3.aws_s3_bucket_versioning.glue_scripts: Refreshing state... [id=de1-prod-glue-scripts]
module.networking.aws_security_group.glue: Refreshing state... [id=sg-0a274d5c024852289]
module.networking.aws_vpc_endpoint.s3: Refreshing state... [id=vpce-0b5dca8e0137bc8d1]
module.networking.aws_security_group.lambda: Refreshing state... [id=sg-0b379fd5958365622]
module.networking.aws_subnet.private[0]: Refreshing state... [id=subnet-06aa99f65daf2a308]
module.networking.aws_subnet.private[1]: Refreshing state... [id=subnet-01bc2ef5f29ad9096]
module.glue.aws_iam_role_policy.glue_s3_access: Refreshing state... [id=de1-prod-glue-role:glue-s3-access]
module.glue.aws_glue_job.example_etl: Refreshing state... [id=de1-prod-example-etl]
module.s3.aws_s3_bucket_versioning.lambda_packages: Refreshing state... [id=de1-prod-lambda-packages]
module.s3.aws_s3_bucket_server_side_encryption_configuration.lambda_packages: Refreshing state... [id=de1-prod-lambda-packages]
module.s3.aws_s3_bucket_public_access_block.lambda_packages: Refreshing state... [id=de1-prod-lambda-packages]
module.lambda.aws_iam_role_policy.lambda_s3_access: Refreshing state... [id=de1-prod-lambda-role:lambda-s3-access]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.lambda.aws_lambda_function.example_function will be created
  + resource "aws_lambda_function" "example_function" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "de1-prod-example-function"
      + handler                        = "handler.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::273130558322:role/de1-prod-lambda-role"
      + runtime                        = "python3.12"
      + s3_bucket                      = "de1-prod-lambda-packages"
      + s3_key                         = "functions/example_function.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Name" = "de1-prod-example-function"
        }
      + tags_all                       = {
          + "Environment" = "prod"
          + "ManagedBy"   = "terraform"
          + "Name"        = "de1-prod-example-function"
          + "Project"     = "de1"
          + "Repository"  = "de1-infrastructure"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENVIRONMENT"  = "prod"
              + "PROJECT_NAME" = "de1"
            }
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0b379fd5958365622",
            ]
          + subnet_ids                  = [
              + "subnet-01bc2ef5f29ad9096",
              + "subnet-06aa99f65daf2a308",
            ]
          + vpc_id                      = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>

**Status:** success